{
  "lofi": [
    "Lo-fi (short for low fidelity) embraces imperfections such as tape hiss and vinyl crackle as an aesthetic.",
    "Lo-fi hip-hop became popular as study/background music thanks to long streaming playlists and continuous mixes.",
    "Many lo-fi producers intentionally use old recording equipment or emulate tape saturation to create warmth.",
    "The relaxed BPM range (usually 60–90 BPM) in lo-fi helps create a calm, focus-friendly atmosphere.",
    "Lo-fi visuals often reference analog media, study scenes, and nostalgia to reinforce the mood.",
    "Some lo-fi tracks are produced from short sampled loops layered with soft drums and mellow chords.",
    "The term 'lo-fi' was first used in the 1950s to describe recordings made outside professional studios.",
    "Lo-fi music gained mainstream popularity in the 2010s through YouTube channels like ChilledCow (now Lofi Girl).",
    "Jazz samples are a cornerstone of lo-fi hip-hop, often featuring smooth saxophone or piano melodies.",
    "Lo-fi artists frequently use sidechain compression to create a 'pumping' effect that adds rhythmic interest."
  ],

  "classical": [
    "The piano was invented around 1700 by Bartolomeo Cristofori and revolutionized keyboard music.",
    "Baroque music (1600–1750) often uses counterpoint — independent melodic lines played simultaneously.",
    "The classical era (1750–1820) emphasized clarity, balanced structures, and the development of the symphony.",
    "Orchestral scores use specific instrument ranges and timbres to create textures composers carefully design.",
    "Many classical composers worked as musicians in courts or churches rather than as independent artists.",
    "Research shows that listening to certain classical music can reduce stress and improve concentration for some listeners.",
    "Beethoven composed some of his greatest works, including his Ninth Symphony, after becoming completely deaf.",
    "The violin family (violin, viola, cello, double bass) evolved from earlier string instruments in the 16th century.",
    "Classical music notation has remained largely unchanged for over 1,000 years, allowing modern musicians to play ancient compositions.",
    "The 'Mozart Effect' theory suggests that listening to Mozart's music may temporarily enhance spatial-temporal reasoning."
  ],

  "blues": [
    "Blues originated in the late 19th and early 20th century in the African-American communities of the U.S. South.",
    "The 12-bar blues is a common chord progression that forms the basis of countless blues songs.",
    "Early blues used call-and-response patterns, a musical structure with deep roots in African traditions.",
    "Field hollers, work songs, and spirituals strongly influenced the melodic and emotional character of the blues.",
    "Blues techniques like bending notes and slide guitar create a vocal, human quality on instruments.",
    "The blues heavily influenced later genres such as jazz, rock 'n' roll, and R&B.",
    "Robert Johnson, a legendary blues musician, was said to have sold his soul to the devil at a crossroads to master the guitar.",
    "The 'blue note' is a flattened third, fifth, or seventh scale degree that gives blues its distinctive melancholic sound.",
    "Delta blues, originating in the Mississippi Delta, is characterized by slide guitar and raw, emotional vocals.",
    "Blues music was added to the UNESCO Representative List of the Intangible Cultural Heritage of Humanity in 2023."
  ]
}
